src/DataProcessors/ЛичныйКабинет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ЛичныйКабинет</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ОповещениеМониторингКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОповещениеМониторингКлиента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Старт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодОповещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗаголовокОкна</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметр_1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметр_2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметр_3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметр_4</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметр_5</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектОповещения</Name>
					<Comment>Исполнитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СервисыSMSРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СервисыSMSРассылки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HelixSMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RocketSMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMSC_KZ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TeraSMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TurboSMS</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/СервисыРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СервисыРассылки</Name>
			<Comment>Сервисы рассылки</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>SMSСервис</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СервисыSMSРассылки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Comment>Пароль зарегистрированного пользователя SMS-сервиса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подпись</Name>
					<Comment>Подпись к SMS сообщениям</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Зарегистрированный пользователь SMS-рассылки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьОдобрена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ВнешниеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВнешниеСистемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторизацияПоКодуБезСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Comment>Внешняя система используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрованияОбратногоЗвонка</Name>
					<Comment>Используется для обратного звонка в CRM</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синхронизирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнейСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Comment>Используется для отправки Push уведомлений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеВЛичномКабинете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ЛичныйКабинет/Forms/ФормаЛичногоКабинета/Ext/Form/Module.bsl
&НаКлиенте
Перем ПредыдущаяСтрокаСчетаСМС;
&НаКлиенте
Перем ГруппаНастроекОткрыта;
&НаКлиенте
Перем ИндексВнешнейСистемы;

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
// 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.РежимРаботыВМоделиСервиса = ЛичныйКабинет.ЛиныйКабинетВМоделиСервиса();
	ЭтотОбъект.УидСессии                 = ЛичныйКабинет.УидТекущейСессии();
	ЭтотОбъект.РегистрационныйНомер      = ЛичныйКабинет.ПолучитьРегистрационныйНомерПродукта();
	
	Элементы.ГруппаДоговоры.Видимость			  			   = Ложь;
	Элементы.ГруппаДоговор_ДляКопирования.Видимость 	   	   = Ложь;
	Элементы.ГруппаРегистрацииПодписи_ДляКопирования.Видимость = Ложь;
	Элементы.ГруппаСМССтрокаСчета_ДляКопирования.Видимость	   = Ложь;
	Элементы.ГруппаВнешниеСистемы.Видимость       		   	   = Ложь;
	Элементы.ГруппаВнешняяСистема_ДляКопирования.Видимость 	   = Ложь;
	Элементы.ГруппаСохранитьНастройки.Видимость 			   = Ложь;
	
	Если ЭтотОбъект.РежимРаботыВМоделиСервиса = Ложь Тогда
		ВойтиВЛичныйКабинет();
	Иначе
		ВойтиВЛичныйКабинетРежимеМоделиСервиса();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.УидСессии)
		И ЭтотОбъект.РегистрацияПодтверждена Тогда
		
		ПроверитьСуществованиеиСоздатьвнешниеСистемы();
		
		ОбновитьИнформациюОПодарке();
		
		СинхронизироватьСервисыSMSИВывестиДоговорыCRM();
		
		НастроитьРазделВнешнихСистем();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриОткрытии".
// 
Процедура ПриОткрытии(Отказ)
	
	Если ЭтотОбъект.ВходРазрешен = Ложь Тогда
		
		Отказ = Истина;
		ОткрытьФорму("Обработка.ЛичныйКабинет.Форма.ФормаРегистрации");
		
	Иначе	
		
		Если ЭтотОбъект.ТаблицаДоговоровСМС.НайтиСтроки(Новый Структура("ОбновитьИнформациюОМодерацииПодписи", Истина)).Количество() > 0 Тогда
			ПодключитьОбработчикОжидания("ОбновитьИнформациюОМодерацииПодписиСОбработкойОжидания", 60, Истина);
		КонецЕсли;
		
		Оповестить("ВыполненВходВЛК");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаОповещения".
// 
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СозданСчетНаПополнениеСмсСервиса" Тогда
		
		ПредыдущаяСтрокаСчетаСМС = Неопределено;
		ОбработатьСозданиеСчетаНаПополнениеСмсСервиса();
		
	ИначеЕсли ИмяСобытия = "ИзмененаПодписьСервисаСМС" Тогда
		
		ОбновитьИнформациюОМодерацииПодписиСОбработкойОжидания();
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьСозданиеСчетаНаПополнениеСмсСервиса()
	
	ОчиститьГруппуДоговоры();
	СинхронизироватьСервисыSMSИВывестиДоговорыCRM();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - Обработка события ОбработкаНавигационнойСсылки
// 
Процедура ДекорацияРегистрацииПодписиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИдДоговора = ПолучитьИндексИмениЭлемента(Элемент.Имя);
	
	Если ЗначениеЗаполнено(ИдДоговора) Тогда
		
		СервисСМС = ЭтотОбъект.ТаблицаДоговоровСМС[Число(ИдДоговора)].СервисСМС;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("СервисSMS", СервисСМС);
		
		Если НавигационнаяСсылкаФорматированнойСтроки = "ПовторитьПопытку" Тогда
			СтруктураПараметров.Вставить("НеСоздаватьНовуюПодпись", Истина);
		КонецЕсли;
		
		ОткрытьФорму("Обработка.ЛичныйКабинет.Форма.ФормаПолученияПодписиСервисаСМС", СтруктураПараметров);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды "ПополнитьБаланс".
// 
Процедура ПополнитьБаланс(Команда)
	
	ИДСтроки = ПолучитьИндексИмениЭлемента(ЭтаФорма.ТекущийЭлемент.Имя);
	
	ПараметрыФормы = Новый Структура("СервисSMS", ЭтотОбъект.ТаблицаДоговоровСМС[ИДСтроки].СервисСМС);
	ОткрытьФорму("Обработка.ЛичныйКабинет.Форма.ФормаЗапросаПополненияБалансаСмсСервиса", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ОбновитьИнформациюСМС".
// 
Процедура ОбновитьИнформациюСМС(Команда)
	
	ОбновитьИнформациюСМССервер();
	
	Если ЗначениеЗаполнено(ЭтотОбъект.УидСессии)
		И ЭтотОбъект.РегистрацияПодтверждена Тогда
		
		ПредыдущаяСтрокаСчетаСМС = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обновляет информацию о договорах и внешних системах.
// 
Процедура ОбновитьИнформациюСМССервер()
	
	Если Не ЭтотОбъект.РежимРаботыВМоделиСервиса Тогда
		ОбновитьИнформациюОРегистрации();
	Иначе
		ЭтотОбъект.РегистрацияПодтверждена = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.УидСессии)
		И ЭтотОбъект.РегистрацияПодтверждена Тогда
		
		ПроверитьСуществованиеиСоздатьвнешниеСистемы();
		
		ОчиститьГруппуДоговоры();
		
		СинхронизироватьСервисыSMSИВывестиДоговорыCRM();
		
		НастроитьРазделВнешнихСистем();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура сохраняет счет на оплату в файл
// 
Процедура СкачатьСчет(Команда)
	
	ИДСтроки = ПолучитьИндексИмениЭлемента(ЭтаФорма.ТекущийЭлемент.Имя);
	СтрокаТЧ = ЭтотОбъект.ТаблицаСчетов[ИДСтроки];
	
	ДиалогВыбораМестаЗаписиФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбораМестаЗаписиФайла.ПолноеИмяФайла 	= СтрокаТЧ.Представление + ".pdf";
	ДиалогВыбораМестаЗаписиФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораМестаЗаписиФайла.Фильтр 			= "(*.pdf)|*.pdf";
	
	Оповещение = Новый ОписаниеОповещения("СформироватьФайлСчетаЗавершение", ЭтотОбъект, Новый Структура("УидСчета", СтрокаТЧ.УидСчета));
	
	ДиалогВыбораМестаЗаписиФайла.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
// Процедура формирует файл из двоичных данных
// 
Процедура СформироватьФайлСчетаЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено
		И Результат.Количество() > 0 Тогда
		
		ДвоичныеДанныеФайла = ЛичныйКабинет.ПолучитьДвоичныеДанныеФайлаСчета(ЭтотОбъект.УидСессии, ДопПараметры.УидСчета);
		
		ПолноеИмяФайла = Результат[0];
		ДвоичныеДанныеФайла.Записать(ПолноеИмяФайла);
		
		Оповещение = Новый ОписаниеОповещения("ОткрытьСформированныйФайлЗавершение", ЭтотОбъект, Новый Структура("ПолноеИмяФайла", ПолноеИмяФайла));
		ПоказатьВопрос(Оповещение, "Открыть скачанный файл счета на оплату?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура открывает сформированный файл счета на оплату
// 
Процедура ОткрытьСформированныйФайлЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Если ДопПараметры <> Неопределено
			И ДопПараметры.Свойство("ПолноеИмяФайла") Тогда
			Оповещение = Новый ОписаниеОповещения("ПослеЗапускаПриложения",,,, ЭтотОбъект);
			НачатьЗапускПриложения(Оповещение , ДопПараметры.ПолноеИмяФайла);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - После запуска приложения
//
// Параметры:
//  ВыбранныйЭлемент - 	 - 
//  Параметры		 - 	 - 
//
Процедура ПослеЗапускаПриложения(ВыбранныйЭлемент, Параметры) Экспорт
	// Процедура заглушка, т.к. НачатьЗапускПриложения требуется наличие обработчика оповещения.
	Возврат;
КонецПроцедуры

&НаКлиенте
// Процедура - Обработка команды СкрытьГруппуEmail
// 
Процедура СкрытьГруппуEmail(Команда)
	
	СкрытьГруппуEmailВСтрокеСчета();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Скрыть группу email на клиенте
// 
Процедура СкрытьГруппуEmailВСтрокеСчета()
	
	Элементы.ГруппаEmail.Видимость = Ложь;
	
	Если ПредыдущаяСтрокаСчетаСМС <> Неопределено Тогда
		Элементы["КнопкаСкачатьСчет_" + ПредыдущаяСтрокаСчетаСМС].Видимость 	 		= Истина;
		Элементы["КнопкаОтправитьНаПочту_" + ПредыдущаяСтрокаСчетаСМС].Заголовок 	    = "Отправить на почту";
		Элементы["ДекорацияЗаглушкаВКонцеСтроки_" + ПредыдущаяСтрокаСчетаСМС].Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработка команды ОтправитьНаПочту
// 
Процедура ОтправитьНаПочту(Команда)
	
	ИДСтроки = ПолучитьИндексИмениЭлемента(ЭтаФорма.ТекущийЭлемент.Имя);
	СтрокаТЧ = ЭтотОбъект.ТаблицаСчетов[ИДСтроки];
	
	Если Элементы.ГруппаEmail.Видимость
		И ЗначениеЗаполнено(ЭтотОбъект.Email)
		И Элементы.ГруппаEmail.Родитель = Элементы["ГруппаСкачатьСчет_" + ИДСтроки] Тогда
		
		ОписаниеОшибки = "";
		Если НЕ ЭлектроннаяПочтаКорректна(ЭтотОбъект.Email, ОписаниеОшибки) Тогда
			ПоказатьПредупреждение(, ОписаниеОшибки);
			Возврат;
		КонецЕсли;
		
		Результат = ЛичныйКабинет.ОтправитьСчетаНаОплатуНаПочту(ЭтотОбъект.УидСессии, СтрокаТЧ.УидСчета, ЭтотОбъект.Email);
		
		Если Результат.ВыполненоУспешно Тогда
			ПоказатьПредупреждение(, "Файл отправлен на почту");
			СкрытьГруппуEmailВСтрокеСчета();			
		Иначе
			ПоказатьПредупреждение(, Результат.ОписаниеОшибки);
		КонецЕсли;
		
	Иначе
		ИзменитьПоложениеПоляВводаEmail(ИДСтроки, ПредыдущаяСтрокаСчетаСМС);
		ПредыдущаяСтрокаСчетаСМС = ИДСтроки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, перемещает поле ввода email.
// 
Процедура ИзменитьПоложениеПоляВводаEmail(ИДСтроки, ПредыдущаяСтрока)
	
	КнопкаОтправитьНаПочту = Элементы["КнопкаОтправитьНаПочту_" + ИДСтроки];
	
	ЭтаФорма.Элементы.Переместить(Элементы.ГруппаEmail, Элементы["ГруппаСкачатьСчет_" + ИДСтроки], КнопкаОтправитьНаПочту);
	
	Если ПредыдущаяСтрока <> Неопределено Тогда
		Элементы["КнопкаСкачатьСчет_" + ПредыдущаяСтрока].Видимость 	 		= Истина;
		Элементы["КнопкаОтправитьНаПочту_" + ПредыдущаяСтрока].Заголовок 		= "Отправить на почту";
		Элементы["ДекорацияЗаглушкаВКонцеСтроки_" + ПредыдущаяСтрока].Видимость = Истина;
	КонецЕсли;
	
	Элементы.ГруппаEmail.Видимость = Истина;
	Элементы["КнопкаСкачатьСчет_" + ИДСтроки].Видимость 	 		= Ложь;
	КнопкаОтправитьНаПочту.Заголовок 	   							= "Отправить";
	Элементы["ДекорацияЗаглушкаВКонцеСтроки_" + ИДСтроки].Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "УстановитьСервисСМСПоУмолчанию".
// 
Процедура УстановитьСервисСМСПоУмолчанию(Команда)
	
	ТекущаяКнопка = ЭтаФорма.ТекущийЭлемент;
	ИндексСтроки  = ПолучитьИндексИмениЭлемента(ТекущаяКнопка.Имя);
	
	ТекущаяКнопка.Картинка = БиблиотекаКартинок.УспешноОкей;
	
	НайденныеСтроки  = ЭтотОбъект.ТаблицаДоговоровСМС.НайтиСтроки(Новый Структура("ЭтоСервисСМСПоУмолчанию", Истина));
	ПредыдущийИндекс = ?(НайденныеСтроки.Количество() <> 0, ЭтотОбъект.ТаблицаДоговоровСМС.Индекс(НайденныеСтроки[0]), Неопределено);
	
	Если ПредыдущийИндекс <> ИндексСтроки Тогда
		
		Если НайденныеСтроки.Количество() <> 0 Тогда
			НайденныеСтроки[0].ЭтоСервисСМСПоУмолчанию = Ложь;
		КонецЕсли;
		
		ЭтотОбъект.ТаблицаДоговоровСМС[ИндексСтроки].ЭтоСервисСМСПоУмолчанию = Истина;
		
		ИзменитьКонстантуСервисSMSРассылкиПоУмолчанию(ЭтотОбъект.ТаблицаДоговоровСМС[ИндексСтроки].СервисСМС);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "АвторизацияПоКодуБезСМС".
// 
Процедура АвторизацияПоКодуБезСМС(Команда)
	
	ИндексВнешнейСистемы = ПолучитьИндексИмениЭлемента(Элементы.ГруппаНастройки.Родитель.Имя);
	СтрокаТЧ 			 = ЭтотОбъект.ТаблицаВнешнихСистем[ИндексВнешнейСистемы];
	
	СписокВыбора = Новый СписокЗначений;
	
	СписокВыбора.Добавить(Истина, "Авторизация без СМС");
	
	СписокВыбора.Добавить(Ложь, "Авторизация с подтверждением по СМС");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборТипиАвторизацииОкончание", ЭтотОбъект, Новый Структура("Индекс", ИндексВнешнейСистемы));
	ЭтаФорма.ПоказатьВыборИзМеню(ОписаниеОповещения, СписокВыбора, Элементы.АвторизацияПоКодуБезСМС);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик выбора типа авторизации.
// 
Процедура ВыборТипиАвторизацииОкончание(Результат, Параметр) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		СтрокаТЧ = ЭтотОбъект.ТаблицаВнешнихСистем[Параметр.Индекс];
		
		Если СтрокаТЧ.АвторизацияПоКодуБезСМС <> Результат.Значение Тогда
			
			СтрокаТЧ.АвторизацияПоКодуБезСМС = Результат.Значение;
			Элементы.АвторизацияПоКодуБезСМС.Заголовок = Результат.Представление;
			
			ЗаписатьВнешнююСистему(СтрокаТЧ.Ссылка, СтрокаТЧ.АвторизацияПоКодуБезСМС);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ИспользуетсяПриИзменении(Элемент)
	
	Элементы.ГруппаСохранитьНастройки.Видимость = Истина;
	
КонецПроцедуры

#Область ВходВыход

// Процедура - Войти в личный кабинет
// 
&НаСервере
Процедура ВойтиВЛичныйКабинет()
	
	СостояниеСессии = ЛичныйКабинет.ПроверитьСостояниеСессии(ЭтотОбъект.УидСессии);
		
	Если СостояниеСессии.ВыполненоУспешно = Истина 
		И СостояниеСессии.ВходРазрешен = Истина Тогда
		
		ЭтотОбъект.ВходРазрешен = Истина;
		
		СтатусРегистрацииКод = Неопределено;
		ОбновитьИнформациюОРегистрации(СтатусРегистрацииКод);
		
		УстановитьФлагОповещениеОСтатусеВыполнено(СтатусРегистрацииКод);
		
	КонецЕсли;
		
КонецПроцедуры

// Процедура - Войти в личный кабинет режиме модели сервиса
// 
&НаСервере
Процедура ВойтиВЛичныйКабинетРежимеМоделиСервиса()
		
	ЭтотОбъект.ВходРазрешен = Истина;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.РегистрационныйНомер) Тогда
		СостояниеСессии = ЛичныйКабинет.ПроверитьСостояниеСессии(ЭтотОбъект.УидСессии);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.РегистрационныйНомер)
		ИЛИ СостояниеСессии.ВыполненоУспешно = Ложь
		ИЛИ СостояниеСессии.ВходРазрешен = Ложь Тогда
		
		СостояниеСессии = ЛичныйКабинет.ВойтиВЛичныйКабинетМодельСервиса();
		
		Если СостояниеСессии.ВыполненоУспешно = Истина
			И СостояниеСессии.ВходРазрешен = Истина Тогда
			
			ЭтотОбъект.УидСессии            = СостояниеСессии.УидСессии;
			ЭтотОбъект.РегистрационныйНомер = СостояниеСессии.РегистрационныйНомер;
			
			Если ЛичныйКабинет.ПолучитьРегистрационныйНомерПродукта() = Неопределено Тогда
				ЛичныйКабинет.ЗаписатьРегистрационныйНомер(ЭтотОбъект.РегистрационныйНомер);
			КонецЕсли;
			
			ЛичныйКабинет.УстановитьУидОткрытойСессии(ЭтотОбъект.УидСессии);
			
		Иначе
			ТекстСообщения = ?(СостояниеСессии.ВыполненоУспешно = Истина, СостояниеСессии.ОписаниеРезультата, СостояниеСессии.ОписаниеОшибки);
			УстановитьСостояниеСообщенияНаФорме(ТекстСообщения, 2);
		КонецЕсли;
		
	КонецЕсли;
	
	Если СостояниеСессии.ВходРазрешен = Истина Тогда
		
		ЭтотОбъект.РегистрацияПодтверждена = Истина;
		ЭтаФорма.Заголовок = "Личный кабинет, регистрация: " + ЭтотОбъект.РегистрационныйНомер;
		
		//ОбновитьИнформациюОРегистрации();	
		//УстановитьФлагОповещениеОСтатусеВыполнено();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить информацию о поддержке
// 
Процедура ОбновитьИнформациюОРегистрации(СтатусРегистрацииКод = Неопределено)
	
	УстановитьСостояниеСообщенияНаФорме("");
	
	ТекущаяРегистрацияПродукта = ЛичныйКабинет.ДанныеПоСостояниюАнкетыПродукта(ЭтотОбъект.РегистрационныйНомер);
	
	Если ТекущаяРегистрацияПродукта.ВыполненоуСпешно = Истина Тогда 
		
		СтатусРегистрацииКод 	  = ТекущаяРегистрацияПродукта.СтатусРегистрацииКод;
		СтатусРегистрацииОписание = ТекущаяРегистрацияПродукта.СтатусРегистрацииОписание;
		ЭтаФорма.Заголовок        = "Личный кабинет, регистрация: " + ЭтотОбъект.РегистрационныйНомер;
		
		ЭтотОбъект.РегистрацияПодтверждена = СтатусРегистрацииКод = 304;
		
		Если СтатусРегистрацииКод = 304 Тогда
			
			ЭтаФорма.Заголовок  = ЭтаФорма.Заголовок  + " - подтверждена.";
			
		ИначеЕсли СтатусРегистрацииКод = 302 Тогда	 
			
			ЭтаФорма.Заголовок  = ЭтаФорма.Заголовок  + " - находится на проверке, ожидайте подтверждения.";
            УстановитьСостояниеСообщенияНаФорме(СтатусРегистрацииОписание, 1);
			
		Иначе
			
			ЭтаФорма.Заголовок = ЭтаФорма.Заголовок  + " - отклонена";
			УстановитьСостояниеСообщенияНаФорме(СтатусРегистрацииОписание, 2);
			
		КонецЕсли;

	Иначе
		
		ЭтаФорма.Заголовок = "Личный кабинет";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекущаяРегистрацияПродукта.Описаниеошибки);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Установить состояние сообщения о регистрации
// 
&НаСервере
Процедура УстановитьСостояниеСообщенияНаФорме(ТекстСообщения, РежимОтображения = 0)
	
	Элементы.ГруппаСообщениеНаФорме.Видимость = ЗначениеЗаполнено(ТекстСообщения);
	
	Если РежимОтображения = 0 Тогда
	
		Элементы.СообщениеНаФорме.ЦветТекста      = WebЦвета.Черный;
		ЭтотОбъект.СообщениеНаФорме               = ТекстСообщения; 
		
	ИначеЕсли РежимОтображения = 1 Тогда	 
		
		Элементы.СообщениеНаФорме.ЦветТекста      = WebЦвета.Оранжевый;
		ЭтотОбъект.СообщениеНаФорме               = ТекстСообщения;           
		
	ИначеЕсли РежимОтображения = 2 Тогда
		
		Элементы.СообщениеНаФорме.ЦветТекста      = WebЦвета.Красный;		
		ЭтотОбъект.СообщениеНаФорме               = ТекстСообщения;	
		
	КонецЕсли;

КонецПроцедуры

// Процедура - Установить флаг оповещение о статусе выполнено
// 
&НаСервере
Процедура УстановитьФлагОповещениеОСтатусеВыполнено(СтатусРегистрацииКод)
	
	ДанныеАнкеты = ЛичныйКабинет.ПолучитьДанныеРегистрационнойАнкеты();
	
	Если ДанныеАнкеты <> Неопределено Тогда
		
		РегистрацияПринята          		   = ?(ДанныеАнкеты.Свойство("РегистрацияПринята"), ДанныеАнкеты.РегистрацияПринята, Ложь);
		РегистрацияОповещениеОСтатусеВыполнено = ?(ДанныеАнкеты.Свойство("РегистрацияОповещениеОСтатусеВыполнено"), ДанныеАнкеты.РегистрацияОповещениеОСтатусеВыполнено, Ложь);
		
		// Если анкета зарегистрирована, но не подтверждена
		Если РегистрацияПринята = Истина 
			И РегистрацияОповещениеОСтатусеВыполнено <> Истина
			И СтатусРегистрацииКод >= 303
			И СтатусРегистрацииКод <= 306 Тогда
			
			ДанныеАнкеты.РегистрацияОповещениеОСтатусеВыполнено = Истина;
			
			ЛичныйКабинет.ЗаписатьДанныеРегистрационнойАнкеты(ДанныеАнкеты);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Процедура - Настройки публикации
// 
// Параметры:
//  Команда	 - 	 - 
// 
&НаКлиенте
Процедура НастройкиПубликации(Команда)
	
	Оповещение = Новый ОписаниеОповещения("НастройкаВнешнейПубликацииЗавершение",ЭтотОбъект, Новый Структура("АктивацияПриложения", Ложь));
	ОткрытьФорму("Обработка.ЛичныйКабинет.Форма.ФормаНастройкиВнешнейПубликации",,ЭтаФорма,,,,
		Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Процедура - Настройка внешней публикации завершение
// 
&НаКлиенте
Процедура НастройкаВнешнейПубликацииЗавершение(Результат, ДопПарметры) Экспорт
	
	ВнешняяПубликацияНастроена = ЛичныйКабинет.ВнешняяПубликацияНастроена();
	
	Элементы.НастройкиПубликации.Заголовок          = "Внешняя публикация" + ?(ВнешняяПубликацияНастроена, " ", " не ") + "настроена";
	Элементы.ГруппаВнешниеСистемыНастрйоки.ЦветФона = ?(ВнешняяПубликацияНастроена,  Новый Цвет(224, 224, 224), Новый Цвет(25, 116, 206));
	Элементы.НастройкиПубликации.ЦветТекста         = ?(ВнешняяПубликацияНастроена,  Новый Цвет(77, 77, 77), Новый Цвет(255, 255, 255));
	
	Если ДопПарметры.АктивацияПриложения = Истина
		И ВнешняяПубликацияНастроена = Истина Тогда
		
		ИдСтроки 	   = ПолучитьИндексИмениЭлемента(ЭтаФорма.ТекущийЭлемент.Имя);
		СтрокаТЧ 	   = ЭтотОбъект.ТаблицаВнешнихСистем[ИдСтроки];
		ОписаниеОшибки = Неопределено;
		
		Если Не ВнешняяСистемаАктивироватьНаСервере(ИдСтроки, НЕ СтрокаТЧ.Используется, ОписаниеОшибки) Тогда
			ПоказатьПредупреждение(,ОписаниеОшибки);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СмсСервис

&НаСервере
// Процедура - Синхронизировать сервисы SMSрассылки с договорами CRM
// 
Процедура СинхронизироватьСервисыSMSИВывестиДоговорыCRM()
	
	Результат = ЛичныйКабинет.ПолучитьДоговорыПользователяСИсториейСчетов(ЭтотОбъект.УидСессии);
	
	Если Результат.ВыполненоУспешно <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСервисовСМС 		= Справочники.СервисыРассылки.ПолучитьСервисыSMSрассылки();
	МассивСтруктурДоговоров = Результат.ПараметрыРезультата.contracts;
	
	ИДСтроки = 0;
	
	Для Каждого СтруктураМассива Из МассивСтруктурДоговоров Цикл
		
		Если СтруктураМассива.invoices.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ГруппаДоговор = КопироватьГруппуФормы(Элементы.ГруппаДоговор_ДляКопирования, Формат(ИДСтроки, "ЧН=; ЧГ="), Элементы.ГруппаДоговоры);
		
		// Синхронизация договора
		Если СтруктураМассива.contract_type.type = "sms_service" Тогда
			
			МассивНайденныхСервисов = ТаблицаСервисовСМС.НайтиСтроки(Новый Структура("Пользователь", СтруктураМассива.login));
			
			Если МассивНайденныхСервисов.Количество() = 0 Тогда
				СервисСМС = СоздатьСервисSMSрассылки(СтруктураМассива.login, СтруктураМассива.password, СтруктураМассива.sign);
			Иначе
				СервисСМС = МассивНайденныхСервисов[0].Ссылка;
			КонецЕсли;
			
		КонецЕсли;
		
		ЗаполнитьГруппуСМСЗаголовок(ИДСтроки, СтруктураМассива, СервисСМС);
		
		МассивПараметров 				  = Новый Массив;
		Пользователь     				  = ПараметрыСеанса.ТекущийПользователь;
		ИспользоватьСистемуВзаимодействия = ОбсужденияСистемыВзаимодействия.СистемаВзаимодействияВключена();
		
		Для Каждого СчетНаОплату Из СтруктураМассива.invoices Цикл
			
			НоваяСтрока 			     = ЭтотОбъект.ТаблицаСчетов.Добавить();
			НоваяСтрока.УидСчета 	     = СчетНаОплату.uid;
			НоваяСтрока.ТипДокумента     = СчетНаОплату.type;
			НоваяСтрока.Представление    = СчетНаОплату.presentation;
			НоваяСтрока.СуммаДокумента 	 = СчетНаОплату.sum;
			НоваяСтрока.СуммаОплаты      = СчетНаОплату.paid;
			НоваяСтрока.ИДГруппыДоговора = ИДСтроки;
			
			Если НоваяСтрока.ТипДокумента = "invoice" 
				И НоваяСтрока.СуммаДокумента > НоваяСтрока.СуммаОплаты 
				И НоваяСтрока.СуммаДокумента > 0 Тогда
				
				Сумма = (НоваяСтрока.СуммаДокумента - НоваяСтрока.СуммаОплаты);
				ПредставлениеСчетНаОплату = НоваяСтрока.Представление + " не оплачен. Сумма счета " + Формат(Сумма, "ЧДЦ=2") + " руб";
				
				Если ИспользоватьСистемуВзаимодействия = Истина Тогда
					
					// Создание оповещения через систему взаимодействия.
					ДанныеСообщения = Новый Структура;
					ДанныеСообщения.Вставить("Ключ"						, "ПоказатьОповещениеПользователяСчетНеОплачен");
					ДанныеСообщения.Вставить("ПредставлениеСчетНаОплату", ПредставлениеСчетНаОплату);
										
					ОбсужденияСистемыВзаимодействия.ДобавитьСообщениеВСистемуВзаимодействия(ДанныеСообщения, Пользователь);
					
				Иначе
					
					// Создание оповещения через регистр сведений.
					МассивПараметров.Добавить(ПредставлениеСчетНаОплату);
					РегистрыСведений.ОповещениеМониторингКлиента.ДобавитьОповещениеКлиента(Пользователь, 
																						   Неопределено, 
																						   "ПоказатьОповещениеПользователяСчетНеОплачен", 
																						   ТекущаяДата(), 
																						   60, , , 
																						   МассивПараметров);
				КонецЕсли;		
			КонецЕсли;
			
		КонецЦикла;
		
		ИДСтроки = ИДСтроки + 1;
		
	КонецЦикла;
	
	ЗаполнитьГруппуСМС();
	
КонецПроцедуры

&НаСервере
// Процедура создает элемент справочника СервисыSMSрассылки
// 
Функция СоздатьСервисSMSрассылки(Логин, Пароль, Подпись)
	
	НовыйЭлемент 			  = Справочники.СервисыРассылки.СоздатьЭлемент();
	НовыйЭлемент.Пользователь = Логин;
	НовыйЭлемент.Пароль 	  = Пароль;
	НовыйЭлемент.Подпись 	  = Подпись;
	НовыйЭлемент.SMSСервис	  = Перечисления.СервисыSMSРассылки.HelixSMS;
	
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции

&НаСервере
// Процедура заполняет ГруппуСМСЗаголовок
// 
Процедура ЗаполнитьГруппуСМСЗаголовок(ИДГруппыДоговор, СтруктураДоговора, СервисСМС = Неопределено)
	
	СтрокаИдентификатор = Формат(ИДГруппыДоговор, "ЧН=; ЧГ=");
	ЭтоСервисСМС 		= СтруктураДоговора.contract_type.type = "sms_service";
	
	ГруппаДоговор 			   = Элементы["ГруппаДоговор_" + СтрокаИдентификатор];
	ГруппаДоговорЗаголовок 	   = КопироватьГруппуФормы(Элементы.ГруппаДоговорЗаголовок_ДляКопирования, СтрокаИдентификатор, ГруппаДоговор);
	
	Если ЭтоСервисСМС Тогда
		КнопкаСервисСМСПоУмолчанию = КопироватьКнопкуФормы(Элементы.КнопкаСервисСМСПоУмолчанию_ДляКопирования, СтрокаИдентификатор, ГруппаДоговорЗаголовок);
	КонецЕсли;
	
	ГруппаДекорацияЗаголовка   = КопироватьГруппуФормы(Элементы.ГруппаДекорацияЗаголовка_ДляКопирования, СтрокаИдентификатор, ГруппаДоговорЗаголовок);
	ДекорацияДоговорЗаголовок  = КопироватьЭлементФормы(Элементы.ДекорацияДоговорЗаголовок_ДляКопирования, СтрокаИдентификатор, ГруппаДекорацияЗаголовка);
	
	Если ЭтоСервисСМС Тогда
		
		ГруппаРегистрацииПодписи = КопироватьГруппуФормы(Элементы.ГруппаРегистрацииПодписи_ДляКопирования, СтрокаИдентификатор, ГруппаДоговорЗаголовок);
		КопироватьЭлементФормы(Элементы.ДекорацияРегистрацииПодписи_ДляКопирования, СтрокаИдентификатор, ГруппаРегистрацииПодписи);
		КопироватьЭлементФормы(Элементы.ДекорацияЗаглушкаЗаголовка_ДляКопирования , СтрокаИдентификатор, ГруппаДоговорЗаголовок);
		
		ГруппаБаланс 	  		 = КопироватьГруппуФормы(Элементы.ГруппаБаланс_ДляКопирования, СтрокаИдентификатор, ГруппаДоговорЗаголовок);
		ДекорацияБалансСМС 		 = КопироватьЭлементФормы(Элементы.ДекорацияБалансСМС_ДляКопирования, СтрокаИдентификатор, ГруппаБаланс);
		КнопкаПополнитьБаланс    = КопироватьКнопкуФормы(Элементы.ПополнитьБаланс_ДляКопирования, СтрокаИдентификатор, ГруппаБаланс);
		
		ГруппаРегистрацииПодписи.Видимость = Ложь;
		
	КонецЕсли;
	
	Если ЭтоСервисСМС Тогда
		ЗаполнитьЭлементыЗаголовкаСервисаСМС(СервисСМС, ИДГруппыДоговор, КнопкаСервисСМСПоУмолчанию, ДекорацияБалансСМС, КнопкаПополнитьБаланс);
		ДекорацияДоговорЗаголовок.Заголовок = "СМС - " + СтруктураДоговора.login;
	Иначе
		ДекорацияДоговорЗаголовок.Заголовок = СтруктураДоговора.contract_type.type_name + ?(ЗначениеЗаполнено(СтруктураДоговора.contract_number), " № " + СтруктураДоговора.contract_number, "") + " от " + СтруктураДоговора.contract_date;
	КонецЕсли;
	
	ДекорацияДоговорЗаголовок.Ширина = ?(ЭтоСервисСМС, 18, 0);
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить элементы заголовка сервиса СМС
// 
Процедура ЗаполнитьЭлементыЗаголовкаСервисаСМС(СервисСМС, ИДГруппыДоговор, КнопкаСервисСМСПоУмолчанию, ДекорацияБалансСМС, КнопкаПополнитьБаланс)
	
	СервисСМСПоУмолчанию 	= Константы.СервисSMSРассылкиПоУмолчанию.Получить();
	ЭтоСервисСМСПоУмолчанию = Ложь;
	
	Если ЗначениеЗаполнено(СервисСМСПоУмолчанию)
		И СервисСМС = СервисСМСПоУмолчанию Тогда
		КнопкаСервисСМСПоУмолчанию.Картинка = БиблиотекаКартинок.УспешноОкей;
		ЭтоСервисСМСПоУмолчанию = Истина;
	Иначе
		//КнопкаСервисСМСПоУмолчанию.Картинка = БиблиотекаКартинок.ЗанятиеВыкл;
	КонецЕсли;
	
	ОписаниеОшибки = "";
	
	НоваяСтрока = ЭтотОбъект.ТаблицаДоговоровСМС.Добавить();
	НоваяСтрока.СервисСМС				= СервисСМС;
	НоваяСтрока.ЭтоСервисСМСПоУмолчанию = ЭтоСервисСМСПоУмолчанию;
	
	Если СервисСМС.ПодписьОдобрена
		И ЗначениеЗаполнено(СервисСМС.Подпись) Тогда
		
		НоваяСтрока.ОбновитьИнформациюОМодерацииПодписи = Ложь;
	Иначе
		НоваяСтрока.ОбновитьИнформациюОМодерацииПодписи = ОбновитьИнформациюОМодерацииПодписиСервисаСМС(ИДГруппыДоговор, СервисСМС, ОписаниеОшибки);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		
		Результат = Справочники.СервисыРассылки.ПолучитьБалансАккаунтаSMS(СервисСМС);
		ДекорацияБалансСМС.Заголовок 	  = "Баланс: " + ?(НЕ Результат.Ошибка, "" + Результат.Баланс + " " + Результат.Валюта, "недоступно");
		КнопкаПополнитьБаланс.Доступность = ?(Результат.Ошибка, Ложь, КнопкаПополнитьБаланс.Доступность);
		
	Иначе
		ДекорацияБалансСМС.Заголовок	  = "Баланс: недоступно";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура динамически выводит список счетов на оплату
// 
Процедура ЗаполнитьГруппуСМС()
	
	ИДСтроки = 0;
	
	Для Каждого СтрокаТЧ Из ТаблицаСчетов Цикл
		
		ЭтоСтрокаСчетаНаОплату = (СтрокаТЧ.ТипДокумента = "invoice");
		ДокументОплачен 	   = НЕ (СтрокаТЧ.СуммаДокумента > СтрокаТЧ.СуммаОплаты);
		СтатусОплатыДокумента  = ?(ДокументОплачен, "Оплачен", "Не оплачен");
		
		ГруппаДоговор = Элементы["ГруппаДоговор_" + Формат(СтрокаТЧ.ИДГруппыДоговора, "ЧН=; ЧГ=")];
		
		СтрокаИдентификатор = Формат(ИДСтроки, "ЧН=; ЧГ=");
		
		ГруппаСтроки = КопироватьГруппуФормы(Элементы.ГруппаСМССтрокаСчета_ДляКопирования, СтрокаИдентификатор, ГруппаДоговор);
		ГруппаСтроки.Видимость = Истина;
		
		КопироватьЭлементФормы(Элементы.ДекорацияЗаглушкаВНачалеСтроки_ДляКопирования, СтрокаИдентификатор, ГруппаСтроки);
		ДекорацияСчет 		 = КопироватьЭлементФормы(Элементы.ДекорацияСчет_ДляКопирования				  , СтрокаИдентификатор, ГруппаСтроки);
		ДекорацияСтатусСчета = КопироватьЭлементФормы(Элементы.ДекорацияСтатусСчета_ДляКопирования		  , СтрокаИдентификатор, ГруппаСтроки);
		ДекорацияСуммаСчета  = КопироватьЭлементФормы(Элементы.ДекорацияСуммаСчета_ДляКопирования		  , СтрокаИдентификатор, ГруппаСтроки);
		
		ГруппаСкачатьСчет = КопироватьГруппуФормы(Элементы.ГруппаСкачатьСчет_ДляКопирования, СтрокаИдентификатор, ГруппаСтроки);
		
		КнопкаСкачатьСчет 	   = КопироватьКнопкуФормы(Элементы.КнопкаСкачатьСчет_ДляКопирования	 , СтрокаИдентификатор, ГруппаСкачатьСчет);
		КнопкаОтправитьНаПочту = КопироватьКнопкуФормы(Элементы.КнопкаОтправитьНаПочту_ДляКопирования, СтрокаИдентификатор, ГруппаСкачатьСчет);
		
		ДекорацияЗаглушкаВКонцеСтроки = КопироватьЭлементФормы(Элементы.ДекорацияЗаглушкаВКонцеСтроки_ДляКопирования, СтрокаИдентификатор, ГруппаСкачатьСчет);
		ДекорацияЗаглушкаВКонцеСтроки.АвтоМаксимальнаяШирина = ЭтоСтрокаСчетаНаОплату;
		
		ЦветТекстаЭлементов = ?(ДокументОплачен, WebЦвета.ЗеленыйЛес, WebЦвета.Киноварь);
		
		ДекорацияСчет.Заголовок 	   	  = СтрокаТЧ.Представление;
		ДекорацияСчет.ЦветТекста 		  = ?(ЭтоСтрокаСчетаНаОплату, ЦветТекстаЭлементов, Новый Цвет(51,51,51));
		ДекорацияСтатусСчета.Заголовок 	  = ?(ЭтоСтрокаСчетаНаОплату, СтатусОплатыДокумента, "");
		ДекорацияСтатусСчета.ЦветТекста   = ?(ЭтоСтрокаСчетаНаОплату, ЦветТекстаЭлементов, Новый Цвет(51,51,51));
		ДекорацияСуммаСчета.Заголовок  	  = Формат(СтрокаТЧ.СуммаДокумента,"ЧДЦ=2") + " руб.";
		ДекорацияСуммаСчета.ЦветТекста    = ?(ЭтоСтрокаСчетаНаОплату, ЦветТекстаЭлементов, Новый Цвет(51,51,51));
		КнопкаСкачатьСчет.Видимость 	  = ЭтоСтрокаСчетаНаОплату;
		КнопкаСкачатьСчет.ЦветТекста 	  = ЦветТекстаЭлементов;
		КнопкаОтправитьНаПочту.Видимость  = ЭтоСтрокаСчетаНаОплату;
		КнопкаОтправитьНаПочту.ЦветТекста = ЦветТекстаЭлементов;
		
		ИДСтроки = ИДСтроки + 1;
		
	КонецЦикла;
	
	Элементы.ГруппаДоговоры.Видимость = ТаблицаСчетов.Количество() > 0;
	
КонецПроцедуры

&НаСервере
// Процедура очищает список счетов на оплату
// 
Процедура ОчиститьГруппуДоговоры()
	
	Элементы.Переместить(Элементы.ГруппаEmail	 , Элементы.ГруппаДоговор_ДляКопирования);
	Элементы.Переместить(Элементы.ГруппаНастройки, Элементы.ГруппаВнешняяСистема_ДляКопирования, Элементы.ГруппаВнешняяСистемаАктиваци_ДляКопирования);
	
	МассивИсключаемыхЭлементов = Новый Массив;
	МассивИсключаемыхЭлементов.Добавить(Элементы.ГруппаДоговорыЗаголовок);
	МассивИсключаемыхЭлементов.Добавить(Элементы.ГруппаДоговор_ДляКопирования);
	
	УдалитьПодчиненныеЭлементыГруппы(Элементы.ГруппаДоговоры, МассивИсключаемыхЭлементов);
	
	ЭтотОбъект.ТаблицаСчетов.Очистить();
	ЭтотОбъект.ТаблицаДоговоровСМС.Очистить();
	
КонецПроцедуры

&НаСервере
// Процедура проверяет наличие подарка
// 
Процедура ОбновитьИнформациюОПодарке()
	
	ДанныеАнкеты = ЛичныйКабинет.ПолучитьДанныеРегистрационнойАнкеты();
	
	Если ДанныеАнкеты <> Неопределено
		И ДанныеАнкеты.Свойство("ПриветственноеНачислениеПолучено")
		И ДанныеАнкеты.ПриветственноеНачислениеПолучено = Истина Тогда
		
		Возврат;
	КонецЕсли;
	
	Результат = Неопределено;
	
	Если ЭтотОбъект.РежимРаботыВМоделиСервиса Тогда
		
		НомерОбласти = ЛичныйКабинет.ПолучитьНомерОбласти();
		
		Если ЗначениеЗаполнено(НомерОбласти) Тогда
			Результат = ЛичныйКабинет.ПроверитьНаличиеПодарка(, НомерОбласти);
		КонецЕсли;
		
	Иначе
		
		РегистрационныйНомер = ЛичныйКабинет.ПолучитьРегистрационныйНомерПродукта();
		
		Если ЗначениеЗаполнено(РегистрационныйНомер) Тогда
			Результат = ЛичныйКабинет.ПроверитьНаличиеПодарка(РегистрационныйНомер);
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат)
		И Результат.ВыполненоУспешно <> Истина Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ОписаниеОшибки);
		Возврат;
		
	КонецЕсли;
	
	НаличиеПодарка = Результат.ПараметрыРезультата.welcome_amount;
	
	Если НаличиеПодарка = Истина Тогда
		
		// Получить подарок
		Результат = ЛичныйКабинет.ПолучитьПодарок(ЭтотОбъект.УидСессии);
		
		Если Результат.ВыполненоУспешно <> Истина
			ИЛИ Результат.ПараметрыРезультата.welcome_amount_credited <> Истина Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить подарочную сумму на счет." + Символы.ПС + Результат.ОписаниеОшибки);
			Возврат;
			
		КонецЕсли;
		
		ЗаполнитьФлагПриветственноеНачислениеПолучено();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция - Обновить информацию о модерации подписи сервиса СМС
// 
Функция ОбновитьИнформациюОМодерацииПодписиСервисаСМС(ИДГруппыДоговор, СервисSMSРассылки, ОписаниеОшибки = "")
	
	Возврат Справочники.СервисыРассылки.ОбновитьИнформациюОМодерацииПодписиСервисаСМС(СервисSMSРассылки, ЭтаФорма, ИДГруппыДоговор, ОписаниеОшибки);
	
КонецФункции

&НаКлиенте
// Процедура - Обновить информацию о модерации подписи с обработкой ожидания
// 
Процедура ОбновитьИнформациюОМодерацииПодписиСОбработкойОжидания()
	
	Индекс = 0;
	
	Для Каждого СтрокаТЧ Из ЭтотОбъект.ТаблицаДоговоровСМС Цикл
		
		Если СтрокаТЧ.ОбновитьИнформациюОМодерацииПодписи Тогда
			СтрокаТЧ.ОбновитьИнформациюОМодерацииПодписи = ОбновитьИнформациюОМодерацииПодписиСервисаСМС(Индекс, СтрокаТЧ.СервисСМС);
		КонецЕсли;
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Если ЭтотОбъект.ТаблицаДоговоровСМС.НайтиСтроки(Новый Структура("ОбновитьИнформациюОМодерацииПодписи", Истина)).Количество() > 0 Тогда
		ПодключитьОбработчикОжидания("ОбновитьИнформациюОМодерацииПодписиСОбработкойОжидания", 60, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РазделВнешнихСистем

&НаСервере
// Процедура, отображает раздел внешних систем.
//
Процедура НастроитьРазделВнешнихСистем()
	
	Элементы.НастройкиПубликации.Видимость = Не ЭтотОбъект.РежимРаботыВМоделиСервиса;
		
	МассивИсключаемыхЭлементов = Новый Массив;
	МассивИсключаемыхЭлементов.Добавить(Элементы.ГруппаВнешниеСистемыЗаголовок);
	МассивИсключаемыхЭлементов.Добавить(Элементы.ГруппаВнешняяСистема_ДляКопирования);
	
	УдалитьПодчиненныеЭлементыГруппы(Элементы.ГруппаВнешниеСистемы, МассивИсключаемыхЭлементов);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВнешниеСистемы.Ссылка КАК Ссылка,
	|	ВнешниеСистемы.Наименование КАК Наименование,
	|	ВнешниеСистемы.ТипВнешнейСистемы КАК ТипВнешнейСистемы,
	|	ВнешниеСистемы.Используется КАК Используется,
	|	ВнешниеСистемы.АвторизацияПоКодуБезСМС КАК АвторизацияПоКодуБезСМС
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	НЕ ВнешниеСистемы.ПометкаУдаления
	|	И ВнешниеСистемы.УправлениеВЛичномКабинете");
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ЭтотОбъект.ТаблицаВнешнихСистем.Загрузить(Результат);
	ЭтотОбъект.ТаблицаСтруктурныхЕдиниц.Очистить();
	
	ГруппаВнешниеСистемы = Элементы.ГруппаВнешниеСистемы;
	Для Каждого СтрокаТЗ ИЗ ЭтотОбъект.ТаблицаВнешнихСистем Цикл
		
		Индекс 				  = ЭтотОбъект.ТаблицаВнешнихСистем.Индекс(СтрокаТЗ);
		ЭтоВиджетОнлайнЗаписи = СтрокаТЗ.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.ВиджетОнлайнЗаписи;
		ПутьКДанным 		  = "ТаблицаВнешнихСистем[" + Индекс + "].";
		
		Если ЭтоВиджетОнлайнЗаписи Тогда
			
			МассивСтруктурныхЕдиниц 	   = ВернутьМассивСтруктурныхЕдиниц();
			ПараметрыВнешнейСистемы 	   = СтрокаТЗ.Ссылка.Параметры.Получить();
			ИспользуемыеСтруктурныеЕдиницы = Новый Массив;
			
			Если ПараметрыВнешнейСистемы <> Неопределено И ПараметрыВнешнейСистемы.Свойство("ИспользуемыеСтруктурныеЕдиницы") Тогда
				ИспользуемыеСтруктурныеЕдиницы = ПараметрыВнешнейСистемы.ИспользуемыеСтруктурныеЕдиницы;
			КонецЕсли;
			
			Для Каждого СтруктурнаяЕдиница Из МассивСтруктурныхЕдиниц Цикл
				
				НоваяСтрока = ЭтотОбъект.ТаблицаСтруктурныхЕдиниц.Добавить();
				НоваяСтрока.Используется	   = ИспользуемыеСтруктурныеЕдиницы.Найти(СтруктурнаяЕдиница) <> Неопределено;
				НоваяСтрока.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
				НоваяСтрока.ВнешняяСистема 	   = СтрокаТЗ.Ссылка; 
				
			КонецЦикла;
			
		КонецЕсли;
		
		ГруппаСтроки = КопироватьГруппуФормы(Элементы.ГруппаВнешняяСистема_ДляКопирования, Индекс, ГруппаВнешниеСистемы);
		
		КопироватьЭлементФормы(Элементы.ПолеВнешняяСистемаКартинкаСтатуса_ДляКопирования, Индекс, ГруппаСтроки, ПутьКДанным + "КартинкаСтатуса");
		КопироватьЭлементФормы(Элементы.ПолеВнешняяСистемаНаименвоание_ДляКопирования   , Индекс, ГруппаСтроки, ПутьКДанным + "Наименование");
		
		КнопкаОткрытьНастройки = КопироватьКнопкуФормы(Элементы.ОткрытьНастройки_ДляКопирования, Индекс, ГруппаСтроки);
		КнопкаОткрытьНастройки.Видимость = ЭтоВиджетОнлайнЗаписи;
		
		ГруппаКнопки = КопироватьГруппуФормы(Элементы.ГруппаВнешняяСистемаАктиваци_ДляКопирования, Индекс, ГруппаСтроки);
		КопироватьКнопкуФормы(Элементы.ВнешняяСистемаАктивировать_ДляКопирования, Индекс, ГруппаКнопки);
		
		УстановитьСостояниеКнопкиАктивироватьВнешнююСистему(Индекс);
		
	КонецЦикла;
	
	Если Не ЭтотОбъект.РежимРаботыВМоделиСервиса Тогда
		
		Если ЭтотОбъект.ТаблицаВнешнихСистем.Количество() > 0 Тогда
			ПроверитьПубликациюИнформационнойБазы();
		КонецЕсли;
	
		ВнешняяПубликацияНастроена = ЛичныйКабинет.ВнешняяПубликацияНастроена();
		
		Элементы.НастройкиПубликации.Заголовок          = "Внешняя публикация" + ?(ВнешняяПубликацияНастроена, " ", " не ") + "настроена";
		Элементы.ГруппаВнешниеСистемыНастрйоки.ЦветФона = ?(ВнешняяПубликацияНастроена, Новый Цвет(224, 224, 224), Новый Цвет(25, 116, 206));
		Элементы.НастройкиПубликации.ЦветТекста         = ?(ВнешняяПубликацияНастроена, Новый Цвет(77, 77, 77), Новый Цвет(255, 255, 255));
	Иначе
		Элементы.ДекорацияЗаглушкаНастройкиВн.Видимость = Истина;
        Элементы.ГруппаВнешниеСистемыНастрйоки.ЦветФона = Новый Цвет(224, 224, 224);
		Элементы.НастройкиПубликации.ЦветТекста         = Новый Цвет(255, 255, 255);
	КонецЕсли;
	
	Элементы.ГруппаВнешниеСистемы.Видимость = ЭтотОбъект.ТаблицаВнешнихСистем.Количество() > 0;
	
КонецПроцедуры

&НаСервере
// Процедура, устанавливает состояние кнопки активации внешней системы.
// 
Процедура УстановитьСостояниеКнопкиАктивироватьВнешнююСистему(Индекс)
	
	СтрокаТЧ = ЭтотОбъект.ТаблицаВнешнихСистем[Индекс];
	
	Элементы["ВнешняяСистемаАктивировать_" + Индекс].Заголовок  = ?(СтрокаТЧ.Используется, "Отключить", "Активировать");
	Элементы["ГруппаВнешняяСистемаАктиваци_" + Индекс].ЦветФона = ?(СтрокаТЧ.Используется, Новый Цвет(237, 237, 237), Новый Цвет(25, 116, 206));
	Элементы["ВнешняяСистемаАктивировать_" + Индекс].ЦветТекста = ?(СтрокаТЧ.Используется, Новый Цвет(77, 77, 77), Новый Цвет(255, 255, 255));
	
	ЭтотОбъект.ТаблицаВнешнихСистем[Индекс].КартинкаСтатуса = ?(СтрокаТЧ.Используется, БиблиотекаКартинок.УспешноОкей, Неопределено);
	
	КнопкаОткрытьНастройки = Элементы.Найти("ОткрытьНастройки_" + Индекс);
	Если КнопкаОткрытьНастройки <> Неопределено Тогда
		
		ЭтоВиджетОнлайнЗаписи = СтрокаТЧ.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.ВиджетОнлайнЗаписи;
		
		КнопкаОткрытьНастройки.Видимость = СтрокаТЧ.Используется И ЭтоВиджетОнлайнЗаписи;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Внешняя система активировать
// 
// Параметры:
//  Команда	 - 	 - 
// 
&НаКлиенте
Процедура ВнешняяСистемаАктивировать(Команда)
	
	ВнешняяПубликацияНастроена = ЛичныйКабинет.ВнешняяПубликацияНастроена();
	
	Если Не ЭтотОбъект.РежимРаботыВМоделиСервиса И Не ВнешняяПубликацияНастроена Тогда
		
		ПараметрыФормы = Новый Структура("АктивацияПриложения", Истина);
		Оповещение 	   = Новый ОписаниеОповещения("НастройкаВнешнейПубликацииЗавершение",ЭтотОбъект, Новый Структура("АктивацияПриложения", Истина));
		ОткрытьФорму("Обработка.ЛичныйКабинет.Форма.ФормаНастройкиВнешнейПубликации", ПараметрыФормы, ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Возврат;
		
	Иначе
		
		ИдСтроки = ПолучитьИндексИмениЭлемента(ЭтаФорма.ТекущийЭлемент.Имя);
		СтрокаТЧ = ЭтотОбъект.ТаблицаВнешнихСистем[ИдСтроки];
		
		СообщениеОбОшибке = Неопределено;
		Если Не ВнешняяСистемаАктивироватьНаСервере(ИдСтроки, Не СтрокаТЧ.Используется, СообщениеОбОшибке) Тогда
			ПоказатьПредупреждение(, СообщениеОбОшибке);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - При настройке внешней публикации на сервере
// 
// Параметры:
//  КодРезультата		 - 	 - 
//  СообщениеОбОшибке	 - 	 - 
// 
Функция ВнешняяСистемаАктивироватьНаСервере(ИдСтроки, Используется, СообщениеОбОшибке)
	
	СтрокаТЧ 	   		  = ЭтотОбъект.ТаблицаВнешнихСистем[ИдСтроки];
	ВнешняяСистема 		  = СтрокаТЧ.Ссылка;
	СоздатьВнешнююСистему = ВнешняяСистема.Синхронизирована = Ложь;
	
	ВнешняяСистемаИспользуется = СоздатьВнешнююСистему ИЛИ Используется;
	РезультатЗапроса 		   = ОбновитьВнешнююСистемуВ_CRM(ВнешняяСистема, ВнешняяСистемаИспользуется, ЭтотОбъект.УидСессии);
	
	Если (ВнешняяСистема.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.ВиджетОнлайнЗаписи) И РезультатЗапроса.ВыполненоУспешно Тогда
		
		МассивСтруктурныхЕдиниц = Новый Массив;
		Для Каждого Элемент Из ТаблицаСтруктурныхЕдиниц Цикл
			
			Если Элемент.Используется Тогда
				МассивСтруктурныхЕдиниц.Добавить(Элемент.СтруктурнаяЕдиница);
			КонецЕсли;
			
		КонецЦикла;
		
		Если СоздатьВнешнююСистему ИЛИ Используется Тогда
			РезультатЗапроса = ЗарегистироватьВиджет(ВнешняяСистема.КлючПриложения, МассивСтруктурныхЕдиниц);
		Иначе
			РезультатЗапроса = УдалитьРегистрациюВиджета(МассивСтруктурныхЕдиниц);
		КонецЕсли;
		
	КонецЕсли;
	
	Если РезультатЗапроса.ВыполненоУспешно Тогда
		
		Справочники.ВнешниеСистемы.УстановитьСостояниеВнешнейСистеме(ВнешняяСистема, Используется, Истина);
		СтрокаТЧ.Используется = Используется;
		УстановитьСостояниеКнопкиАктивироватьВнешнююСистему(ИдСтроки);
		
		Возврат Истина;
	Иначе
		СообщениеОбОшибке = РезультатЗапроса.ОписаниеОшибки;
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
// Процедура, обработчик команды "ОткрытьНастройки".
// 
Процедура ОткрытьНастройки(Команда)
	
	Индекс = ПолучитьИндексИмениЭлемента(ЭтаФорма.ТекущийЭлемент.Имя);
	ОткрытьНастройкиНаСервере(Индекс, ГруппаНастроекОткрыта);
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик команды "ОткрытьНастройки" на сервере.
// 
Процедура ОткрытьНастройкиНаСервере(Индекс, ГруппаНастроекОткрыта)
	
	Элементы.Переместить(Элементы.ГруппаНастройки, Элементы["ГруппаВнешняяСистема_" + Индекс], Элементы["ОткрытьНастройки_" + Индекс]);
	
	Если ГруппаНастроекОткрыта = Истина Тогда
		Элементы.ГруппаНастройки.Скрыть();
	Иначе
		
		СтрокаТЧ 			  = ЭтотОбъект.ТаблицаВнешнихСистем[Индекс];
		ТекущаяВнешняяСистема = СтрокаТЧ.Ссылка;
		ЭтоВиджетОнлайнЗаписи = СтрокаТЧ.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.ВиджетОнлайнЗаписи;
		
		Элементы.ГруппаТипАвторизации.Видимость			  = Не ЭтоВиджетОнлайнЗаписи;
		Элементы.ГруппаТаблицаСтруктурныхЕдиниц.Видимость = ЭтоВиджетОнлайнЗаписи;
		
		Элементы.ГруппаНастройки.Показать();
		
		Элементы.АвторизацияПоКодуБезСМС.Заголовок = ?(СтрокаТЧ.АвторизацияПоКодуБезСМС, "Авторизация без СМС", "Авторизация с подтверждением по СМС");
		
	КонецЕсли;
	
	ГруппаНастроекОткрыта = Не Элементы.ГруппаНастройки.Скрыта();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "СохранитьНастройки".
//
Процедура СохранитьНастройки(Команда)
	
	Если Не ЗначениеЗаполнено(ТекущаяВнешняяСистема) ИЛИ ЭтотОбъект.ТаблицаВнешнихСистем.НайтиСтроки(Новый Структура("Ссылка", ТекущаяВнешняяСистема)).Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СообщениеОбОшибке = СохранитьНастройкиВиджетаОнлайнЗаписиНаСервере();
	
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		ПоказатьПредупреждение(, СообщениеОбОшибке);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция, регистрирует в reservi структурные единицы, которые должны быть в виджете онлайн записи.
//
Функция СохранитьНастройкиВиджетаОнлайнЗаписиНаСервере()
	
	МассивНайденныхСтрок		= ЭтотОбъект.ТаблицаВнешнихСистем.НайтиСтроки(Новый Структура("Ссылка", ТекущаяВнешняяСистема));
	СтрокаТЧ					= МассивНайденныхСтрок[0];
	ИдСтроки					= ЭтотОбъект.ТаблицаВнешнихСистем.Индекс(СтрокаТЧ);
	ТаблицаСЕ         			= ЭтотОбъект.ТаблицаСтруктурныхЕдиниц;	
	ВнешняяСистема 		  		= СтрокаТЧ.Ссылка;
	
	Используется 	  	 	= Ложь;
	ИспользуемыеСалоны 	 	= Новый Массив;
	НеИспользуемыеСалоны 	= Новый Массив;	
	СтрокаТЧ.Используется	= Используется;
	
	Для Каждого СтрокаТЗ Из ТаблицаСЕ Цикл
		
		Если СтрокаТЗ.ВнешняяСистема <> ВнешняяСистема Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТЗ.Используется Тогда
			Используется = Истина;
			ИспользуемыеСалоны.Добавить(СтрокаТЗ.СтруктурнаяЕдиница);
		ИначеЕсли ТаблицаСЕ.НайтиСтроки(Новый Структура("СтруктурнаяЕдиница, Используется", СтрокаТЗ.СтруктурнаяЕдиница, Истина)).Количество() = 0 Тогда 
			НеИспользуемыеСалоны.Добавить(СтрокаТЗ.СтруктурнаяЕдиница);
		КонецЕсли;
		
	КонецЦикла;
		
	СоздатьВнешнююСистему 	   = ВнешняяСистема.Синхронизирована = Ложь;
	ВнешняяСистемаИспользуется = СоздатьВнешнююСистему ИЛИ Используется;
	
	РезультатЗапроса = ОбновитьВнешнююСистемуВ_CRM(ВнешняяСистема, ВнешняяСистемаИспользуется, ЭтотОбъект.УидСессии);
	
	Если Не РезультатЗапроса.ВыполненоУспешно Тогда
		Возврат РезультатЗапроса.ОписаниеОшибки;
	КонецЕсли;
	
	Если ИспользуемыеСалоны.Количество() > 0 Тогда
		
		РезультатЗапроса = ЗарегистироватьВиджет(ВнешняяСистема.КлючПриложения, ИспользуемыеСалоны);
		
		Если Не РезультатЗапроса.ВыполненоУспешно Тогда
			Возврат РезультатЗапроса.ОписаниеОшибки;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НеИспользуемыеСалоны.Количество() > 0 Тогда
		
		Если Используется Тогда
			РезультатЗапроса = ЛичныйКабинет.УдалитьРегистрациюСтруктурныхЕдиницВиджета(НеИспользуемыеСалоны);
		Иначе
			РезультатЗапроса = УдалитьРегистрациюВиджета(НеИспользуемыеСалоны);
		КонецЕсли;
		
	КонецЕсли;
	
	Если РезультатЗапроса.ВыполненоУспешно Тогда
		
		Справочники.ВнешниеСистемы.УстановитьСостояниеВнешнейСистеме(ВнешняяСистема, Используется, Истина);
		СтрокаТЧ.Используется = Используется;
		УстановитьСостояниеКнопкиАктивироватьВнешнююСистему(ИдСтроки);
		
		Элементы.ГруппаСохранитьНастройки.Видимость = Ложь;
		ЗаписатьИспользуемыеСалоныВПараметрыВнешнейСистемы(ВнешняяСистема, ИспользуемыеСалоны);
		
	Иначе
		Возврат РезультатЗапроса.ОписаниеОшибки;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаписатьИспользуемыеСалоныВПараметрыВнешнейСистемы(ВнешняяСистема, ИспользуемыеСалоны)
	
	ВнешняяСистемаОбъект = ВнешняяСистема.ПолучитьОбъект();
	
	СтруктураПараметров = ВнешняяСистемаОбъект.Параметры.Получить();
	
	Если СтруктураПараметров = Неопределено Тогда
		СтруктураПараметров = Новый Структура;
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ИспользуемыеСтруктурныеЕдиницы", ИспользуемыеСалоны);
	
	ВнешняяСистемаОбъект.Параметры = Новый ХранилищеЗначения(СтруктураПараметров);
	ВнешняяСистемаОбъект.Записать();
	
КонецПроцедуры


#КонецОбласти

#Область ДополнительныеПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция, вернет индекс имени элемента.
//
Функция ПолучитьИндексИмениЭлемента(Наименование)
	
	НомерСимвола = СтрНайти(Наименование, "_");
	Возврат ?(НомерСимвола > 0, Число(Прав(Наименование, СтрДлина(Наименование) - НомерСимвола)), Неопределено);
	
КонецФункции

&НаСервереБезКонтекста
// Процедура - Заполнить константу приветственное начисление получено
// 
Процедура ЗаполнитьФлагПриветственноеНачислениеПолучено()
	
	ЛичныйКабинет.ЗаписатьФлагПолученияПриветственногоНачисления(Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция проверяет корректность адреса электронной почты
// 
Функция ЭлектроннаяПочтаКорректна(ЭлектроннаяПочтаКлиента, СтрокаОшибки)
	
	СтрокаОшибки = "";
	
	Попытка
		Результат = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(ЭлектроннаяПочтаКлиента);
		Если Результат.Количество() > 1 Тогда
			СтрокаОшибки = Нстр("ru = 'Допускается ввод только одного адреса электронной почты'");
		КонецЕсли;
	Исключение
		СтрокаОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат ПустаяСтрока(СтрокаОшибки);
	
КонецФункции

// Функция - Получить организацию салона
// 
// Возвращаемое значение:
//   - 
// 
&НаСервереБезКонтекста
Функция ПолучитьОрганизациюСалона()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления
	|	И НЕ Организации.ЭтоГруппа");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
	
КонецФункции

// Процедура - Проверить существованиеи создатьвнешние системы
// 
&НаСервере
Процедура ПроверитьСуществованиеиСоздатьвнешниеСистемы()
	
	  ТипыУпрИзКабинета = Справочники.ВнешниеСистемы.ТипыВнешнихСистемУправляемыхизЛичногоКабинета();
	  
	  Для Каждого ТипСистемы ИЗ ТипыУпрИзКабинета Цикл
		  
		  ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(,ТипСистемы, Ложь);
		  
		  Если НЕ ЗначениеЗаполнено(ВнешняяСистема) Тогда
			  
			  ВнешняяСистема = Справочники.ВнешниеСистемы.СоздатьВнешнююСистему(ТипСистемы);
			  
			  Если ТипСистемы = Перечисления.ТипыВнешнихСистем.ВиджетОнлайнЗаписи Тогда
				  
				  РезультатЗапроса = ОбновитьВнешнююСистемуВ_CRM(ВнешняяСистема,, ЭтотОбъект.УидСессии);
				  
				  Если РезультатЗапроса.ВыполненоУспешно = Истина Тогда				
					  Справочники.ВнешниеСистемы.УстановитьСостояниеВнешнейСистеме(ВнешняяСистема, Истина, Истина);				
				  КонецЕсли;
				  
			  КонецЕсли;
			  
		  КонецЕсли;
		  
	  КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура, записывает внешнюю систему.
// 
Процедура ЗаписатьВнешнююСистему(ВнешняяСистема, АвторизацияПоКодуБезСМС)
	
	ВнешняяСистемаОбъект = ВнешняяСистема.ПолучитьОбъект();
	ВнешняяСистемаОбъект.АвторизацияПоКодуБезСМС = АвторизацияПоКодуБезСМС;
	ВнешняяСистемаОбъект.Записать();
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура, устанавливает константу СервисSMSРассылкиПоУмолчанию.
// 
Процедура ИзменитьКонстантуСервисSMSРассылкиПоУмолчанию(СервисСМС)
	
	Константы.СервисSMSРассылкиПоУмолчанию.Установить(СервисСМС);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает массив структурных единиц.
// 
Функция ВернутьМассивСтруктурныхЕдиниц()
	
	Возврат Справочники.СтруктурныеЕдиницы.ВернутьМассивСтруктурныхЕдиниц()
	
КонецФункции

&НаСервере
// Функция, создает копию группы формы.
//
Функция КопироватьГруппуФормы(ГруппаИсточник, Индекс, Родитель)
	
	Возврат УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(ЭтаФорма, ГруппаИсточник, Индекс, Родитель);
	
КонецФункции

&НаСервере
// Функция, создает копию элемента формы.
//
Функция КопироватьЭлементФормы(ЭлементИсточник, Индекс, Родитель, ПутьКДанным = Неопределено)
	
	Возврат УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(ЭтаФорма, ЭлементИсточник, Индекс,, Родитель, ПутьКДанным);
	
КонецФункции

&НаСервере
// Функция, создает копию кнопки формы.
//
Функция КопироватьКнопкуФормы(КнопкаИсточник, Индекс, Родитель)
	
	Возврат УправлениеИнтерфейсамиСервер.КопироватьКнопкуФормы(ЭтаФорма, КнопкаИсточник, Индекс, Родитель);
	
КонецФункции

&НаСервере
// Процедура, удаляет подчиненные элементы в родительской группе.
//
Процедура УдалитьПодчиненныеЭлементыГруппы(ГруппаРодитель, ИсключаемыеЭлементы)
	
	УправлениеИнтерфейсамиСервер.УдалитьПодчиненныеЭлементыГруппы(ЭтаФорма, ГруппаРодитель, ИсключаемыеЭлементы);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьВнешнююСистемуВ_CRM(ВнешняяСистема, Используется = Истина, УидСессии)
	
	Возврат ЛичныйКабинет.ОбновитьВнешнююСистемуВ_CRM(ВнешняяСистема, Используется, УидСессии);
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗарегистироватьВиджет(ApiKeyВн, СтруктурныеЕдиницы)
	
	Возврат ЛичныйКабинет.ЗарегистироватьВиджет(ПолучитьОрганизациюСалона(), ApiKeyВн, СтруктурныеЕдиницы);
	
КонецФункции

&НаСервереБезКонтекста
Функция УдалитьРегистрациюВиджета(СтруктурныеЕдиницы)

	Возврат ЛичныйКабинет.УдалитьРегистрациюВиджета(ПолучитьОрганизациюСалона(), СтруктурныеЕдиницы);
	
КонецФункции

&НаСервере
// Процедура - Записать параметры внешней системы на сервере
//
// Параметры:
//  ВнешняяСистемаСсылка - 	 - 
//  ТекстHTML			 - 	 - 
//
Процедура ЗаписатьПараметрыВнешнейСистемыНаСервере(ТекстHTML, ВнешняяСистемаСсылка)	
	
	Попытка
		ВнешняяСистемаОбъект    = ВнешняяСистемаСсылка.ПолучитьОбъект();
		ПараметрыВнешнейСистемы = ВнешняяСистемаОбъект.Параметры.Получить();
		
		Если ПараметрыВнешнейСистемы = Неопределено Тогда
			ПараметрыВнешнейСистемы = Новый Структура();
		КонецЕсли;
		
		ПараметрыВнешнейСистемы.Вставить("ПубличнаяОферта", ТекстHTML);
		
		ВнешняяСистемаОбъект.Параметры = Новый ХранилищеЗначения(ПараметрыВнешнейСистемы);
		ВнешняяСистемаОбъект.Записать();
	Исключение
		
	КонецПопытки;	
	
КонецПроцедуры

&НаСервере
// Процедура, проверяет публикацию информационной базы.
//
Процедура ПроверитьПубликациюИнформационнойБазы()
	
	УстановитьСлужебногоПользователя();
	
	РезультатПроверки = ЛичныйКабинет.ПроверитьПубликациюВнешнейСистемы(Константы.ВнешняяПубликацияАдрес.Получить());	
	Если НЕ (РезультатПроверки.ВыполненоУспешно  И РезультатПроверки.ПубликацияВерна = Истина) Тогда
			
		// Зачищаем пользователя внешней публикации, чтоб было видно, что публикация не верна. При следующей записи, он подтянется снова.
		Константы.ВнешняяПубликацияПользователь.Установить(Неопределено); 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='При проверке публикации возникла ошибка: ';en='With checking publications originated mistake:'") + РезультатПроверки.ОписаниеОшибки);

	КонецЕсли;                                                           
		
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - Установить служебного пользователя
//
Процедура УстановитьСлужебногоПользователя()
	
	Если НЕ ЗначениеЗаполнено(Константы.ВнешняяПубликацияПользователь.Получить()) Тогда
		                         
		СлужебныйПользователь = ПользователиСтоматология.СлужебныйПользовательAPI();
		
		Если НЕ ЗначениеЗаполнено(СлужебныйПользователь) Тогда
			
			СлужебныйПользователь = ПользователиСтоматология.СоздатьСлужебногоПользователяAPI();
			
		КонецЕсли;
		
		Константы.ВнешняяПубликацияПользователь.Установить(СлужебныйПользователь);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
